In [165]:
import pandas as pd
import numpy as np
import matplotlib

In [166]:
#Read the income return on the type of degree CSV
Degrees_Payback = pd.read_csv('degrees-that-pay-back.csv')
Degree_df = pd.DataFrame(Degrees_Payback)

#Ready the salary averages based on college type
Salary_By_College = pd.read_csv('salaries-by-college-type.csv')
College_Salary_df = pd.DataFrame(Salary_By_College)

#Read the income based upon region
Salary_By_Region = pd.read_csv('salaries-by-region.csv')
Region_Salary_df = pd.DataFrame(Salary_By_Region)

In [167]:
Region_Salary_df.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN

In [168]:
#Check for duplicate rows and create a column for duplicate Rows in DF (There were non)
Region_Salary_df["Is_Duplicated"]= Region_Salary_df.duplicated()
Region_Salary_df.head()

#Removing Duplicate Rows if there were any
#Region_Salary_df = Region_Salary_df.drop_duplicates()
#Region_Salary_df

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary,Is_Duplicated
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00",False
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN,False
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN,False
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00",False
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN,False

In [169]:
#Rename the columns and replace the NaN (str) with 0 (integer)
Region_Salary_df.columns = ['School Name', 'Region', 'Starting_Mid', 'Mid_Sal', 'Mid_10th', 'Mid_25th', 'Mid_75th', 'Mid_90th','Is_Duplicated']
Region_Salary_df == Region_Salary_df.fillna(0)
Region_Salary_df.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00",False
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN,False
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN,False
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00",False
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN,False

In [170]:
#Convert columns with Dollar $ign (objects) to numeric values (integer)
Dollar_Cols = ['Starting_Mid', 'Mid_Sal', 'Mid_10th', 'Mid_25th', 'Mid_75th', 'Mid_90th']

for x in Dollar_Cols:
    Region_Salary_df[x] = Region_Salary_df[x].str.replace("$","")
    Region_Salary_df[x] = Region_Salary_df[x].str.replace(",","")
    Region_Salary_df[x] = pd.to_numeric(Region_Salary_df[x])

Region_Salary_df.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
0,Stanford University,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0,False
1,California Institute of Technology (CIT),California,75500.0,123000.0,NaN,104000.0,161000.0,NaN,False
2,Harvey Mudd College,California,71800.0,122000.0,NaN,96000.0,180000.0,NaN,False
3,"University of California, Berkeley",California,59900.0,112000.0,59500.0,81000.0,149000.0,201000.0,False
4,Occidental College,California,51900.0,105000.0,NaN,54800.0,157000.0,NaN,False

In [171]:
#Sort DF by Regions with the Highest to lowest 'Starting_Mid' Salaries
Region_Sort = Region_Salary_df.sort_values(['Region', 'Starting_Mid'], ascending=[True, False])
Region_Sort.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
1,California Institute of Technology (CIT),California,75500.0,123000.0,NaN,104000.0,161000.0,NaN,False
2,Harvey Mudd College,California,71800.0,122000.0,NaN,96000.0,180000.0,NaN,False
0,Stanford University,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0,False
3,"University of California, Berkeley",California,59900.0,112000.0,59500.0,81000.0,149000.0,201000.0,False
5,Cal Poly San Luis Obispo,California,57200.0,101000.0,55000.0,74700.0,133000.0,178000.0,False

In [172]:
#Extract data by Region from the Master DF
Cali_Region = Region_Salary_df.loc[Region_Salary_df["Region"] == "California", :]
Cali_Region.head()

#List salary change over the lenght of mid-career by region; from school with hightest Starting_Mid to lowest Mid_90th
Cali_Sort = Cali_Region.sort_values(['Starting_Mid', 'School Name'], ascending=[False, True])
Cali_Sort.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
1,California Institute of Technology (CIT),California,75500.0,123000.0,NaN,104000.0,161000.0,NaN,False
2,Harvey Mudd College,California,71800.0,122000.0,NaN,96000.0,180000.0,NaN,False
0,Stanford University,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0,False
3,"University of California, Berkeley",California,59900.0,112000.0,59500.0,81000.0,149000.0,201000.0,False
5,Cal Poly San Luis Obispo,California,57200.0,101000.0,55000.0,74700.0,133000.0,178000.0,False

In [173]:
#Give a description of the salary data by region.
Cali_Region.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,28.000000,28.000000,22.000000,28.000000,28.000000,22.000000
mean,51032.142857,93132.142857,47777.272727,67153.571429,127350.000000,167909.090909
std,8982.041901,15787.713309,7818.106689,13791.583105,24665.157611,29931.523581
min,38000.000000,67500.000000,30800.000000,44600.000000,92200.000000,117000.000000
25%,45650.000000,83675.000000,45175.000000,59825.000000,112500.000000,154000.000000
50%,48450.000000,91550.000000,47100.000000,62750.000000,122000.000000,158000.000000
75%,52825.000000,101000.000000,51300.000000,72825.000000,139250.000000,177750.000000
max,75500.000000,129000.000000,68400.000000,104000.000000,184000.000000,257000.000000

In [174]:
Western_Region = Region_Salary_df.loc[Region_Salary_df["Region"] == "Western", :]
Western_Region.head()

#List salary change over the lenght of mid-career by region; from school with hightest Starting_Mid to lowest Mid_90th
Western_Sort = Western_Region.sort_values(['Starting_Mid', 'School Name'], ascending=[False, True])
Western_Sort.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
28,Colorado School of Mines,Western,58100.0,106000.0,62200.0,87900.0,142000.0,201000.0,False
30,New Mexico Institute of Mining and Technology ...,Western,51000.0,93400.0,NaN,67400.0,123000.0,NaN,False
31,Brigham Young University (BYU),Western,49400.0,88600.0,50600.0,68500.0,119000.0,164000.0,False
33,University of Washington (UW),Western,48800.0,85300.0,47000.0,59800.0,115000.0,149000.0,False
56,Regis University,Western,48300.0,73800.0,41000.0,55500.0,94800.0,117000.0,False

In [175]:
Western_Sort.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,42.000000,42.000000,34.000000,42.000000,42.000000,34.000000
mean,44414.285714,78200.000000,42985.294118,56580.952381,106026.190476,143823.529412
std,3935.180377,9743.740955,5473.192651,9008.078707,14107.169247,20338.753259
min,37300.000000,50600.000000,35400.000000,31800.000000,78400.000000,110000.000000
25%,42050.000000,72600.000000,39200.000000,52650.000000,99225.000000,131250.000000
50%,44850.000000,78850.000000,41700.000000,56650.000000,104000.000000,142500.000000
75%,46575.000000,83125.000000,46000.000000,60025.000000,113000.000000,150000.000000
max,58100.000000,106000.000000,62200.000000,87900.000000,148000.000000,201000.000000

In [176]:
#Extract data by Region from the Master DF
Northeastern_Region = Region_Salary_df.loc[Region_Salary_df["Region"] == "Northeastern", :]
Northeastern_Region.head()

#List salary change over the lenght of mid-career by region; from school with hightest Starting_Mid to lowest Mid_90th
Northeastern_Sort = Northeastern_Region.sort_values(['Starting_Mid', 'School Name'], ascending=[False, True])
Northeastern_Sort.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
222,Massachusetts Institute of Technology (MIT),Northeastern,72200.0,126000.0,76800.0,99200.0,168000.0,220000.0,False
221,Princeton University,Northeastern,66500.0,131000.0,68900.0,100000.0,190000.0,261000.0,False
224,Harvard University,Northeastern,63400.0,124000.0,54800.0,86200.0,179000.0,288000.0,False
226,"Polytechnic University of New York, Brooklyn",Northeastern,62400.0,114000.0,66800.0,94300.0,143000.0,190000.0,False
227,Cooper Union,Northeastern,62200.0,114000.0,NaN,80200.0,142000.0,NaN,False

In [177]:
Northeastern_Sort.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,100.000000,100.000000,82.000000,100.000000,100.000000,82.000000
mean,48496.000000,91352.000000,49101.219512,65479.000000,129576.000000,181926.829268
std,7159.001115,15103.023177,9873.714874,11808.816215,25988.995807,42439.144663
min,36900.000000,62600.000000,32800.000000,42800.000000,85700.000000,117000.000000
25%,43150.000000,80825.000000,42875.000000,57325.000000,111500.000000,151500.000000
50%,47000.000000,88700.000000,47050.000000,62800.000000,125500.000000,173500.000000
75%,52825.000000,101250.000000,53825.000000,72050.000000,143000.000000,197250.000000
max,72200.000000,134000.000000,80000.000000,100000.000000,234000.000000,326000.000000

In [178]:
#Extract data by Region from the Master DF
Midwestern_Region = Region_Salary_df.loc[Region_Salary_df["Region"] == "Midwestern", :]
Midwestern_Region.head()

#List salary change over the lenght of mid-career by region; from school with hightest Starting_Mid to lowest Mid_90th
Midwestern_Sort = Midwestern_Region.sort_values(['Starting_Mid', 'School Name'], ascending=[False, True])
Midwestern_Sort.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
77,University of Missouri - Rolla (UMR),Midwestern,57100.0,95800.0,67600.0,80400.0,122000.0,166000.0,False
70,University of Notre Dame,Midwestern,56300.0,116000.0,66400.0,85100.0,163000.0,235000.0,False
74,Case Western Reserve University,Midwestern,56200.0,96500.0,54900.0,76500.0,123000.0,168000.0,False
73,Illinois Institute of Technology (IIT),Midwestern,56000.0,97800.0,56100.0,77400.0,121000.0,165000.0,False
78,South Dakota School of Mines & Technology,Midwestern,55800.0,93400.0,71500.0,81900.0,122000.0,147000.0,False

In [179]:
Midwestern_Sort.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,71.000000,71.000000,64.000000,71.000000,71.000000,64.000000
mean,44225.352113,78180.281690,43076.562500,57026.760563,107594.366197,147689.062500
std,5068.240560,12997.687923,8438.267749,10379.911337,19125.501953,28818.331452
min,35300.000000,43900.000000,25600.000000,32200.000000,60900.000000,85700.000000
25%,41100.000000,70850.000000,37850.000000,49650.000000,95550.000000,128000.000000
50%,43100.000000,77800.000000,40600.000000,54400.000000,105000.000000,143000.000000
75%,46250.000000,84700.000000,46275.000000,61800.000000,119000.000000,162250.000000
max,57100.000000,116000.000000,71500.000000,85100.000000,174000.000000,255000.000000

In [180]:
#Extract data by Region from the Master DF
Southern_Region = Region_Salary_df.loc[Region_Salary_df["Region"] == "Southern", :]
Southern_Region.head()

#List salary change over the lenght of mid-career by region; from school with hightest Starting_Mid to lowest Mid_90th
Southern_Sort = Southern_Region.sort_values(['Starting_Mid', 'School Name'], ascending=[False, True])
Southern_Sort.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th,Is_Duplicated
141,Rice University,Southern,64000.0,110000.0,55900.0,82100.0,141000.0,216000.0,False
143,Duke University,Southern,58900.0,106000.0,56000.0,77400.0,149000.0,218000.0,False
144,Georgia Institute of Technology,Southern,58300.0,106000.0,67200.0,85200.0,137000.0,183000.0,False
142,Georgetown University,Southern,55000.0,110000.0,60300.0,85800.0,174000.0,248000.0,False
145,Washington and Lee University,Southern,53600.0,104000.0,NaN,82800.0,146000.0,NaN,False

In [181]:
Southern_Sort.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,79.000000,79.000000,71.000000,79.000000,79.000000,71.000000
mean,44521.518987,79505.063291,43074.647887,57506.329114,109662.025316,152769.014085
std,5626.099229,14067.592314,6675.642683,10489.046078,20865.701852,32587.980219
min,34500.000000,51000.000000,32100.000000,36800.000000,70400.000000,91300.000000
25%,41100.000000,70400.000000,38850.000000,50400.000000,97600.000000,129500.000000
50%,43400.000000,79400.000000,42300.000000,56500.000000,107000.000000,150000.000000
75%,47050.000000,87850.000000,46350.000000,62800.000000,121000.000000,168000.000000
max,64000.000000,110000.000000,67200.000000,85800.000000,174000.000000,248000.000000

In [198]:
#Find the mean for each period of Salary change and groupby the Region names
Region_df = Region_Sort.groupby('Region', as_index=False)['Starting_Mid','Mid_Sal','Mid_10th', 'Mid_25th', 'Mid_75th', 'Mid_90th'].mean()
Region_df

,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
0,California,51032.142857,93132.142857,47777.272727,67153.571429,127350.000000,167909.090909
1,Midwestern,44225.352113,78180.281690,43076.562500,57026.760563,107594.366197,147689.062500
2,Northeastern,48496.000000,91352.000000,49101.219512,65479.000000,129576.000000,181926.829268
3,Southern,44521.518987,79505.063291,43074.647887,57506.329114,109662.025316,152769.014085
4,Western,44414.285714,78200.000000,42985.294118,56580.952381,106026.190476,143823.529412

In [200]:
#Create new DF that Sorts Region_df by Hightest to Lowest 'Starting_Mid'
Region_by_Start_Mid = Region_df.sort_values('Starting_Mid', ascending=False)
Region_by_Start_Mid

,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
0,California,51032.142857,93132.142857,47777.272727,67153.571429,127350.000000,167909.090909
2,Northeastern,48496.000000,91352.000000,49101.219512,65479.000000,129576.000000,181926.829268
3,Southern,44521.518987,79505.063291,43074.647887,57506.329114,109662.025316,152769.014085
4,Western,44414.285714,78200.000000,42985.294118,56580.952381,106026.190476,143823.529412
1,Midwestern,44225.352113,78180.281690,43076.562500,57026.760563,107594.366197,147689.062500

In [201]:
#Create new DF that Sorts Region_df by Hightest to Lowest 'Mid_75th'
Region_by_Mid = Region_df.sort_values('Mid_75th', ascending=False)
Region_by_Mid

,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
2,Northeastern,48496.000000,91352.000000,49101.219512,65479.000000,129576.000000,181926.829268
0,California,51032.142857,93132.142857,47777.272727,67153.571429,127350.000000,167909.090909
3,Southern,44521.518987,79505.063291,43074.647887,57506.329114,109662.025316,152769.014085
1,Midwestern,44225.352113,78180.281690,43076.562500,57026.760563,107594.366197,147689.062500
4,Western,44414.285714,78200.000000,42985.294118,56580.952381,106026.190476,143823.529412

In [202]:
#Create new DF that Sorts Region_df by Hightest to Lowest 'Mid_90th'
Region_by_Mid_Late = Region_df.sort_values('Mid_90th', ascending=False)
Region_by_Mid_Late

,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
2,Northeastern,48496.000000,91352.000000,49101.219512,65479.000000,129576.000000,181926.829268
0,California,51032.142857,93132.142857,47777.272727,67153.571429,127350.000000,167909.090909
3,Southern,44521.518987,79505.063291,43074.647887,57506.329114,109662.025316,152769.014085
1,Midwestern,44225.352113,78180.281690,43076.562500,57026.760563,107594.366197,147689.062500
4,Western,44414.285714,78200.000000,42985.294118,56580.952381,106026.190476,143823.529412